shopinvader_partner_vat/tests/cassettes/success.json

interactions:
- request:
    body: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/"
      xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="urn:ec.europa.eu:taxud:vies:services:checkVat:types"
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header/><ns1:Body><ns0:checkVat><ns0:countryCode>FR</ns0:countryCode><ns0:vatNumber>86792377731</ns0:vatNumber></ns0:checkVat></ns1:Body></SOAP-ENV:Envelope>
    headers:
      Connection:
      - close
      Content-Length:
      - '455'
      Content-Type:
      - text/xml; charset=utf-8
      Host:
      - ec.europa.eu
      Soapaction:
      - !!binary |
        IiI=
      User-Agent:
      - Python-urllib/3.5
    method: POST
    uri: http://ec.europa.eu/taxation_customs/vies/services/checkVatService
  response:
    body:
      string: '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><checkVatResponse
        xmlns="urn:ec.europa.eu:taxud:vies:services:checkVat:types"><countryCode>FR</countryCode><vatNumber>86792377731</vatNumber><requestDate>2020-08-28+02:00</requestDate><valid>true</valid><name>SARL
        AKRETION FRANCE</name><address>35 B RUE MONTGOLFIER

        69100 VILLEURBANNE</address></checkVatResponse></soap:Body></soap:Envelope>'
    headers:
      Connection:
      - close
      Content-Type:
      - text/xml; charset=UTF-8
      Date:
      - Fri, 28 Aug 2020 14:57:45 GMT
      Server:
      - Europa
      Transfer-Encoding:
      - chunked
    status:
      code: 200
      message: OK
version: 1
